CSI API ETABS v1
cFrameObj.GetOutputStations Method
 Retrieves frame object output station data
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetOutputStations(
	string Name,
	ref int MyType,
	ref double MaxSegSize,
	ref int MinSections,
	ref bool NoOutPutAndDesignAtElementEnds,
	ref bool NoOutPutAndDesignAtPointLoads
)
Function GetOutputStations (
	Name As String,
	ByRef MyType As Integer,
	ByRef MaxSegSize As Double,
	ByRef MinSections As Integer,
	ByRef NoOutPutAndDesignAtElementEnds As Boolean,
	ByRef NoOutPutAndDesignAtPointLoads As Boolean
) As Integer
Dim instance As cFrameObj
Dim Name As String
Dim MyType As Integer
Dim MaxSegSize As Double
Dim MinSections As Integer
Dim NoOutPutAndDesignAtElementEnds As Boolean
Dim NoOutPutAndDesignAtPointLoads As Boolean
Dim returnValue As Integer
returnValue = instance.GetOutputStations(Name,
	MyType, MaxSegSize, MinSections,
	NoOutPutAndDesignAtElementEnds,
	NoOutPutAndDesignAtPointLoads)
int GetOutputStations(
	String^ Name,
	int% MyType,
	double% MaxSegSize,
	int% MinSections,
	bool% NoOutPutAndDesignAtElementEnds,
	bool% NoOutPutAndDesignAtPointLoads
)
abstract GetOutputStations :
        Name : string *
        MyType : int byref *
        MaxSegSize : float byref *
        MinSections : int byref *
        NoOutPutAndDesignAtElementEnds : bool byref *
        NoOutPutAndDesignAtPointLoads : bool byref -> int
Parameters
Name
Type: System.String
 The name of an existing frame object
MyType
Type: System.Int32
 This is either 1 or 2 indicating how the output stations are specified
maximum segment size, that is, maximum station spacing
minimum number of stations
MaxSegSize
Type: System.Double
 The maximum segment size, that is, the maximum station spacing. This item applies only when MyType = 1. [L]
MinSections
Type: System.Int32
 The minimum number of stations. This item applies only when MyType = 2.
NoOutPutAndDesignAtElementEnds
Type: System.Boolean
 If this item is True, no additional output stations are added at the ends of line elements when the frame object is internally meshed. In ETABS, this item will always be False.
NoOutPutAndDesignAtPointLoads
Type: System.Boolean
 If this item is True, no additional output stations are added at point load locations. In ETABS, this item will always be False.
Return Value
Type: Int32
 Returns zero if the data is successfully retrieved, otherwise it returns a nonzero value
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim MyType As Integer
   Dim MaxSegSize As Double
   Dim MinSections As Integer
   Dim NoOutPutAndDesignAtElementEnds As Boolean
   Dim NoOutPutAndDesignAtPointLoads As Boolean
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'get frame output station data
   ret = SapModel.FrameObj.GetOutputStations("15", MyType, MaxSegSize, MinSections, NoOutPutAndDesignAtElementEnds, NoOutPutAndDesignAtPointLoads)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cFrameObj Interface
ETABSv1 Namespace